Terraform Format and Style: success
Terraform Initialization: success
Terraform Validation: success
Terraform Plan: success

<details><summary>Show Plan</summary>

```

module.csv_upload_bucket.data.cloudfoundry_space.space: Reading...
module.csv_upload_bucket.data.cloudfoundry_service.s3: Reading...
module.redis.data.cloudfoundry_space.space: Reading...
module.redis.data.cloudfoundry_service.redis: Reading...
module.database.data.cloudfoundry_service.rds: Reading...
module.database.data.cloudfoundry_space.space: Reading...
module.egress-space.data.cloudfoundry_org.org: Reading...
module.contact_list_bucket.data.cloudfoundry_service.s3: Reading...
module.contact_list_bucket.data.cloudfoundry_space.space: Reading...
module.csv_upload_bucket.data.cloudfoundry_service.s3: Read complete after 1s [id=440ce9d9-b108-4bbe-80b4-08338f3cc25b]
module.egress-space.data.cloudfoundry_org.org: Read complete after 1s [id=9e428562-a2d9-41b4-9c23-1ef5237fb44e]
module.egress-space.data.cloudfoundry_user.users["9d2f94ce-91a8-427f-863a-eb8778d27735"]: Reading...
module.redis.data.cloudfoundry_service.redis: Read complete after 1s [id=045871d3-d9a8-4a9b-a844-00a067fab054]
module.redis.data.cloudfoundry_space.space: Read complete after 1s [id=9745decb-4988-4bab-88a4-e3f07b36241c]
module.redis.cloudfoundry_service_instance.redis: Refreshing state... [id=ebcfe297-b76f-4d71-a6a7-bf6c12b2587c]
module.database.data.cloudfoundry_service.rds: Read complete after 1s [id=dcfb1d43-f22c-42d3-962c-7ae04eda24e7]
module.csv_upload_bucket.data.cloudfoundry_space.space: Read complete after 1s [id=9745decb-4988-4bab-88a4-e3f07b36241c]
module.csv_upload_bucket.cloudfoundry_service_instance.bucket: Refreshing state... [id=b15631b3-00fb-49f6-a4d3-ebaedfca1cd9]
module.database.data.cloudfoundry_space.space: Read complete after 2s [id=9745decb-4988-4bab-88a4-e3f07b36241c]
module.database.cloudfoundry_service_instance.rds: Refreshing state... [id=b8caaa4f-b3b8-4dbc-ba16-95d3899be5a0]
module.contact_list_bucket.data.cloudfoundry_space.space: Read complete after 1s [id=9745decb-4988-4bab-88a4-e3f07b36241c]
module.egress-space.data.cloudfoundry_user.users["9d2f94ce-91a8-427f-863a-eb8778d27735"]: Read complete after 1s [id=d641990d-6c45-43e7-87a2-fcbf48064e1d]
module.contact_list_bucket.data.cloudfoundry_service.s3: Read complete after 1s [id=440ce9d9-b108-4bbe-80b4-08338f3cc25b]
module.contact_list_bucket.cloudfoundry_service_instance.bucket: Refreshing state... [id=2235b061-2eb9-456a-b70e-b387cec441a9]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.egress-space.cloudfoundry_space.public_egress will be created
  + resource "cloudfoundry_space" "public_egress" {
      + allow_ssh  = (known after apply)
      + auditors   = (known after apply)
      + developers = (known after apply)
      + id         = (known after apply)
      + managers   = (known after apply)
      + name       = "notify-staging-egress"
      + org        = "9e428562-a2d9-41b4-9c23-1ef5237fb44e"
    }

  # module.egress-space.cloudfoundry_space_users.deployers will be created
  + resource "cloudfoundry_space_users" "deployers" {
      + auditors   = (known after apply)
      + developers = [
          + "d641990d-6c45-43e7-87a2-fcbf48064e1d",
        ]
      + force      = false
      + id         = (known after apply)
      + managers   = [
          + "d641990d-6c45-43e7-87a2-fcbf48064e1d",
        ]
      + space      = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @rahearn, Action: `pull_request`*